#Используя функцию map()  и lambda преобразуйте список чисел в список их кубов.

# numbers = [-1, 0, 1, 3, 0.33333]
# cube = map(lambda x: x**3, numbers)
# print(list(cube))

# Дан список цифр. Используя filter() и lambda оставьте только положительные числа в списке.

# numbers = [-1, 0, 1, 2, 4, 6, -3, 0.33333]
# positive = filter(lambda x: x > 0, numbers)
# print(list(positive))

# Создайте файл my_math с функциями сложения, вычитания, деления и умножения. В основном файле импортируйте модуль и используйте эти функции.


# import my_math
# numbers = [2, 5]
# print(my_math.summ(*numbers))
# print(my_math.div(5, 10))
# print(my_math.sub(5, 10))
# print(my_math.mul(6, 10))

# Напишите файл converter, где будут функции, переводящие температуру в градусы цельсия и градусы фаренгейта. Вызовите эти функции в основном файле. Формулы перевода F = 95  C + 32, С =59 (F - 32)
